const questions = [
    {
         id: 1,
         question: "Какой css-селектор отвечает за цвет фона?",
         answers: {
              0: "color",
              1: "bg-color",
              2: "background-color",
              3: "fill-color"
         },
         rightAnswer: 'background-color',
         type: "css",
         hint: 'background-color определяет цвет фона элемента! Значение цвета допускается указывать как в шестнадцатиричной системе, так и в системах RGB, RGBA, HSL, HSLA, так и с помощью предопределенных цветов.'
    },
    {
         id: 2,
         question: "Какой метод массива используется для преобразования элементов массива?",
         answers: {
              0: "map",
              1: "reduce",
              2: "filter",
              3: "forEach"
         },
         rightAnswer: "map",
         type: "es6"
    },
    {
         id: 3,
         question: "Что делает Инкремент?",
         answers: {
              0: "Ничего",
              1: "Уменьшает значение переменной на 1",
              2: "Увеличивает значение переменной на 1",
              3: "Создает массив"
         },
         rightAnswer: "Увеличивает значение переменной на 1",
         type: "es6"
    },
    {
         id: 4,
         question: "Что делает Декремент?",
         answers: {
              0: "Ничего",
              1: "Создает callback функцию",
              2: "Увеличивает значение переменной на 1",
              3: "Уменьшает значение переменной на 1"
         },
         rightAnswer: "Уменьшает значение переменной на 1",
         type: "es6"
    },
    {
         id: 5,
         question: "Какие типы есть у декремента и инкремента?",
         answers: {
              0: "Boolean и String",
              1: "Number и Obj",
              2: "Префиксный и Постфиксный",
              3: "Все из списка"
         },
         rightAnswer: "Префиксный и Постфиксный",
         type: "es6"
    },
    {
         id: 6,
         question: "Что такое конкатенация?",
         answers: {
              0: "Это процесс запуска функции",
              1: "Это процесс разъединения строк (значений) друг с другом используя '-'",
              2: "Это процесс соединения строк (значений) друг с другом используя '+'",
              3: "Это процесс удвоения суммы у чисел  друг с другом используя '*'"
         },
         rightAnswer: "Это процесс соединения строк (значений) друг с другом используя '+'",
         type: "es6"
    },
    {
         id: 7,
         question: "Сколько типов данных существует в JS?",
         answers: {
              0: "5 типов данных ",
              1: "Это процесс разъединения строк (значений) друг с другом используя '-'",
              2: "Это процесс соединения строк (значений) друг с другом используя '+'",
              3: "Это процесс удвоения суммы у чисел  друг с другом используя '*'"
         },
         rightAnswer: "Это процесс соединения строк (значений) друг с другом используя '+'",
         type: "es6"
    }
];